In [16]:
import mysql.connector
import pandas as pd

In [58]:
mydb = mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    passwd = 'Belajardatascience2021!',
    database = 'retrowheels')

In [59]:
mycursor = mydb.cursor()

query1 = 'select offices.city, count(employeeNumber) from offices, employees where employees.officeCode = offices.officeCode group by offices.city'

mycursor.execute(query1)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head()

            city  count(employeeNumber)
0  San Francisco                      6
1         Boston                      2
2            NYC                      2
3          Paris                      5
4          Tokyo                      2

In [60]:
query2 = 'SELECT (SELECT COUNT(productLine) from productLines) as ProductLineNum, (SELECT COUNT(productCode) FROM products) as ProductNumber'

mycursor.execute(query2)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head()

   ProductLineNum  ProductNumber
0               7            110

In [62]:
query3 = 'SELECT orderdetails.productCode, products.productName, products.productLine, SUM(quantityOrdered) as orderQuantity from orderdetails,products where orderdetails.productCode = products.productCode GROUP BY orderdetails.productCode ORDER BY SUM(quantityOrdered) desc LIMIT 5'
mycursor.execute(query3)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df.head()

,productCode,productName,productLine,orderQuantity
0,S18_3232,1992 Ferrari 360 Spider red,Classic Cars,1808
1,S18_1342,1937 Lincoln Berline,Vintage Cars,1111
2,S700_4002,American Airlines: MD-11S,Planes,1085
3,S18_3856,1941 Chevrolet Special Deluxe Cabriolet,Vintage Cars,1076
4,S50_1341,1930 Buick Marquette Phaeton,Vintage Cars,1074

In [85]:
query4 = '''
select customerName, city, country, sum(quantityOrdered) as totalOrder from customers 
join orders using (customerNumber)
join orderdetails using (orderNumber)
where productCode= 'S18_3232'
group by customerName
order by totalOrder desc
limit 5
'''
mycursor.execute(query4)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

                   customerName          city      country totalOrder
0        Euro+ Shopping Channel        Madrid        Spain        308
1               Vida Sport, Ltd        Genève  Switzerland         79
2  Motor Mint Distributors Inc.  Philadelphia          USA         73
3            Muscle Machine Inc           NYC          USA         70
4       Oulu Toy Supplies, Inc.          Oulu      Finland         68

In [86]:
query5 = '''
select productCode, productName, productLine, avg(quantityOrdered) from orderdetails
join products using (productCode)
where productLine= 'Vintage Cars'
group by productName
having avg(quantityOrdered)> (select avg(quantityOrdered) from orderdetails
join products using (productCode) where productLine= 'Vintage Cars')
order by avg(quantityOrdered);
'''
mycursor.execute(query5)

result = mycursor.fetchall()

df = pd.DataFrame(result, columns = mycursor.column_names)
df

,productCode,productName,productLine,avg(quantityOrdered)
0,S24_4258,1936 Chrysler Airflow,Vintage Cars,35.1071
1,S18_2957,1934 Ford V8 Coupe,Vintage Cars,35.1786
2,S18_3320,1917 Maxwell Touring Car,Vintage Cars,35.4286
3,S18_4668,1939 Cadillac Limousine,Vintage Cars,35.5357
4,S18_4522,1904 Buick Runabout,Vintage Cars,36.6667
5,S24_3151,1912 Ford Model T Delivery Wagon,Vintage Cars,36.7037
6,S18_1749,1917 Grand Touring Sedan,Vintage Cars,36.7200
7,S18_2949,1913 Ford Model T Speedster,Vintage Cars,37.0714
8,S50_1341,1930 Buick Marquette Phaeton,Vintage Cars,38.3571
9,S18_3856,1941 Chevrolet Special Deluxe Cabriolet,Vintage Cars,38.4286
10,S18_1342,1937 Lincoln Berline,Vintage Cars,39.6786